{
    "name": "Civil Law Review 1",
    "url": "",
    "facts": "",
    "issue": "",
    "ruling": "",
    "significance": "",
    "correlation": "",
    "details": "",
    "children": [
        {
            "name": "Module 1",
            "url": "",
            "facts": "",
            "issue": "",
            "ruling": "",
            "significance": "",
            "correlation": "",
            "details": "",
            "children": [
                {
                    "name": "I. Effect and Application of Laws",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "Arts. 1-10",
                            "url": "https://jurisprudence.tech/civil-code-arts-1-10/",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "CHAPTER 1: Effect and Application of Laws",
                            "children": [
                                {
                                    "name": "Requisites for a Newspaper to be of General Circulation",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Subscription; Daily Publication; Reach is not Limited to a Locality, but throughout the Philippines",
                                    "children": []
                                },
                                {
                                    "name": "1. Tanada v. Tuvera",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "All statutes, including  those of local application  and private  laws, shall be published as a condition for their effectivity, which shall begin fifteen days after publication unless a different effectivity date is fixed by the legislature.",
                                    "children": []
                                },
                                {
                                    "name": "2. De Roy v. Court of Appeals",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "There is no law requiring the publication of Supreme Court decisions in the  Official  Gazette  before  they  can  be  binding  and  as  a condition to their becoming effective. ",
                                    "children": []
                                },
                                {
                                    "name": "3. People vs., Que Po Lay ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Circulars and regulations especially like the Circular No. 20 of the Central Bank in question which prescribes a penalty for its violation should be published  before  becoming  effective,  this,  on  the  general principle and theory that before the public is bound by its contents, especially its penal provisions, a law, regulation or circular must first be published and the people officially and specifically informed of said contents and its penalties.",
                                    "children": []
                                },
                                {
                                    "name": "4. NPC v. Pinatubo Commercial",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Interpretative  regulations  and those merely internal in nature, that is, regulating only the personnel of the administrative agency and not the public, need not be published.  ",
                                    "children": []
                                },
                                {
                                    "name": "5. Neri vs. Senate Committee on Accountability of Public Officers ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "The Senate Rules of Procedure Governing Inquiries in Aid of Legislation must be published. But not required to be in Official Gazette or a newspaper of general circulation.",
                                    "children": []
                                },
                                {
                                    "name": "6. Pimentel v. SENATE COMMITTEE OF THE WHOLE",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Publication is required for the Rules of the Senate Committee of the Whole to be effective.",
                                    "children": []
                                },
                                {
                                    "name": "7. Valeroso v. People",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "As a general  rule,  penal  laws should  not have  retroactive  application,  lest they acquire the character  of an ex post facto  law.  An exception  to this rule,  however,  is when  the law  is advantageous to the accused. ",
                                    "children": []
                                },
                                {
                                    "name": "8. PNB v. Office of the President",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "While P.D. 957 did not expressly provide for retroactivity in its entirety, yet the same can be plainly  inferred  from the unmistakable  intent  of the law to protect innocent  lot buyers  from scheming subdivision developers. ",
                                    "children": []
                                },
                                {
                                    "name": "9. Commissioner of Internal Revenue v. Philippine Health Care Providers, Inc., ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Section 246 of the 1997 Tax Code, as amended, provides that any revocation, modification or reversal of rulings, circulars, rules and regulations promulgated by the CIR have no retroactive application  if it would prejudice  the taxpayer.  The exceptions  to this rule are: (1) where the taxpayer deliberately misstates or omits material facts from his return or in any document required of him by the BIR; (2) where the facts subsequently gathered by the BIR are materially differ ent from the facts on which the ruling is based, or (3) where the taxpayer acted in bad faith.",
                                    "children": []
                                },
                                {
                                    "name": "10. D.M. Consunji vs. CA",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "mistake of fact",
                                    "correlation": "",
                                    "details": "The choice of a party between inconsistent remedies results in a waiver by election. Where one lacks knowledge of a right,  there  is no  basis upon  which waiver  of  it  can  rest. Ignorance  of  a  material  fact  negates waiver, and waiver cannot be established by a consent given under a mistake or misapprehension of fact. It bears stressing that what negates waiver is lack of knowledge  or a mistake of fact.",
                                    "children": []
                                },
                                {
                                    "name": "11. Cui vs. Arellano University ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "In order to declare a contract void as against public policy, a court must find that the contract as to consideration or the thing to be done, contravenes some established interest of society, or is inconsistent with sound policy and good morals or tends clearly to undermine the security of individual  rights.  ",
                                    "children": []
                                },
                                {
                                    "name": "12. Mecano v. COA",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Repeals  of statutes by implication are not favored. The presumption is against inconsistency and repugnancy for the legislature is presumed to know the existing laws on the subject and not to have  enacted inconsistent or conflicting statutes.",
                                    "children": []
                                },
                                {
                                    "name": "13. People v. Licera ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Article 8 of the Civil Code decrees that judicial decisions applying or interpreting the laws or the Constitution form part of this jurisdiction's legal system. These decisions, although in themselves not laws, constitute evidence of what the laws mean. The application or interpretation placed by the Court upon a law is part of the law as of the date of the enactment of the said law since the Court's application or interpretation  merely establishes the contemporaneous  legislative intent that the construed law purports to carry into effect.",
                                    "children": []
                                },
                                {
                                    "name": "14. Chu Jan vs. Bernas",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Foreseeing that a case might arise to which no law would be exactly applicable, the Civil Code, in the second paragraph of article 6 (now Art. 11), provides that the customs of the place shall be observed, and, in the absence thereof, the general principles of law.",
                                    "children": []
                                },
                                {
                                    "name": "15. People vs. Purisima",
                                    "url": "",
                                    "facts": "",
                                    "issue": "Should the Whereas clauses of the law be considered in the determination of the intent of the law?",
                                    "ruling": "YES",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Legislative intent must be ascertained from a consideration of the statute as a whole, and not of an isolated part or a particular provision alone. This is a cardinal rule of statutory construction. For taken in the abstract, a word or phrase might easily convey a meaning quite different from the one actually intended and evident when the word or phrase is considered with those with which it is associated. Thus, an apparently general provision may have a limited application if read together with other provisions.",
                                    "children": []
                                },
                                {
                                    "name": "Association of International Shipping Lines, Inc. v. Secretary of Finance",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "",
                                    "children": []}
                            ]
                        },
                        {
                            "name": "Arts. 11-18",
                            "url": "https://jurisprudence.tech/civil-code-arts-11-18/",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": [
                                {
                                    "name": "1. Martinez vs. Van Buskirk",
                                    "url": "",
                                    "facts": "The cochero incident",
                                    "issue": "Is the cochero of the defendant negligent in leaving the horses in the manner described by the evidence in this case?",
                                    "ruling": "No. The act of defendant's driver in leaving the horses in the manner proved was not unreasonable or imprudent. ",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Acts, the performance of which has not proved destructive or injurious and which have, therefore, been acquiesced in by society for so long a time that they have ripened into custom, cannot be held to be themselves unreasonable or imprudent. ",
                                    "children": []
                                },
                                {
                                    "name": "2. Yao Kee vs. Sy-Gonzales",
                                    "url": "",
                                    "facts": "Mano Po without the marriage certificate.",
                                    "issue": "Is the validity of the marriage of Sy Kiat to Yao Kee in accordance with Chinese law and customs on marriage conclusive?",
                                    "ruling": "No. ",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "Custom is defined as a rule of conduct formed by repetition of acts, uniformly observed (practiced) as a social rule, legally binding and obligatory. The law requires that a custom must be proved as a fact, according to the rules of evidence [Article 12, Civil Code.] ",
                                    "children": []
                                },
                                {
                                    "name": "3. CIR vs. Primetown",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "a Year shall be understood to be twelve calendar months and the number of days is irrelevant.",
                                    "children": []
                                },
                                {
                                    "name": "4. Van Dorn vs. Ronillo, Jr. et al., ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "Is the divorce decree obtained by an alien abroad valid and binding in the Philippines even if it is contrary to local law and public policy?",
                                    "ruling": "Pursuant to his national law, private respondent is no longer the husband of petitioner. He would have no standing to sue in the case below as petitioner's husband entitled to exercise control over conjugal assets. ",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "aliens may obtain divorces abroad, which may be recognized in the Philippines, provided they are valid according to their national law. ",
                                    "children": []
                                },
                                {
                                    "name": "5. Pilapil vs. Ibay-Somera ",
                                    "url": "",
                                    "facts": "",
                                    "issue": "May an alien file a complaint for adultery after obtaining a divorce decree abroad?",
                                    "ruling": "No.",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "After a divorce has been decreed, the innocent spouse no longer has the right to institute proceedings against the offenders.",
                                    "children": []
                                },
                                {
                                    "name": "6. San Luis v. San Luis",
                                    "url": "",
                                    "facts": "",
                                    "issue": "May a Filipino who is divorced by his alien spouse abroad validly remarry?",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": " If the foreigner obtains a valid foreign divorce, the Filipino spouse shall have capacity to remarry under Philippine law.",
                                    "children": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "II. Human Relations (19-36, New Civil Code)",
                    "url": "https://jurisprudence.tech/civil-code-arts-19-36/",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "1. Uypitching vs. Quiamco",
                            "url": "",
                            "facts": "",
                            "issue": "Should petitioners be held liable for damages despite the claim that their action is merely exercise of their right as seller-mortgagee to foreclose mortgage in case of default?",
                            "ruling": "Yes, petitioners should be held liable. Petitioner corporation failed to bring the proper civil action necessary to acquire legal possession of the motorcycle. Instead, petitioner Uypitching descended on respondent's establishment with his policemen and ordered the seizure of the motorcycle without a search warrant or court order. ",
                            "significance": "",
                            "correlation": "",
                            "details": "The motorcycle thief is the mortgagee. Article 19, also known as the principle of abuse of right, prescribes that a person should not use his right unjustly or contrary to honesty and good faith, otherwise he opens himself to liability. It seeks to preclude the use of, or the tendency to use, a legal right (or duty) as a means to unjust ends.",
                            "children": []
                        },
                        {
                            "name": "2. Wassmer vs. Velez",
                            "url": "",
                            "facts": "",
                            "issue": "Was the breach of Velez in his promise to marry Wassmer constitute an actionable wrong provided that the wedding was formally set and elaborate preparations for the same were made?",
                            "ruling": "Yes, Velez is liable to Wassmer for damages. As stated, mere breach of promise to marry is not an actionable wrong. It must not be overlooked, however, that the extent to which acts not contrary to law may be perpetrated with impunity, is not limitless for Article 21 of said Code provides that any person who wilfully causes loss or injury to another in a manner that is contrary to morals, good customs or public policy shall compensate the latter for the damage.",
                            "significance": "",
                            "correlation": "",
                            "details": "MERE BREACH OF PROMISE TO MARRY IS NOT AN ACTIONABLE WRONG; BUT TO FORMALLY SET A WEDDING AND GO THROUGH ALL THE ABOVE-DESCRIBED PREPARATION AND PUBLICITY, ONLY TO WALK OUT OF IT WHEN THE MATRIMONY IS ABOUT TO BE SOLEMNIZED, IS QUITE DIFFERENT",
                            "children": []
                        },
                        {
                            "name":  "3. Nikko Hotel Manila Garden",
                            "url": "",
                            "facts": "Reyes filed a complaint for damages based on Article 19 and 21 of the New Civil Code. Lim and Hotel Nikko contend that pursuant to the doctrine of volenti non fit injuria, they cannot be made liable for damages as respondent Reyes assumed the risk of being asked to leave (and being embarrassed and humiliated in the process) as he was a gate-crasher.",
                            "issue": "Does Ms. Lim’s treatment to Reyes give rise for an action for damages against the latter and the hotel based on Articles 19 and 21 of the New Civil Code?",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "THE EXERCISE OF A LEGAL RIGHT OR DUTY IN GOOD FAITH AND WITH NO INTENTION TO PREJUDICE OR INJURE ANOTHER WILL NOT GIVE RISE TO AN ACTION FOR DAMAGES",
                            "children": []
                        },
                        {
                            "name": "4. Gashem Shookat Baksh vs. CA",
                            "url": "",
                            "facts": "",
                            "issue": "Was the petitioner’s breach of promise to marry contrary to morals, good customs, and public policy so as to entitle private respondent to the award of damages?",
                            "ruling": "Yes. where a man's promise to marry is in fact the proximate cause of the acceptance of his love by a woman and his representation to fulfill that promise thereafter becomes the proximate cause of the giving of herself unto him in a sexual congress, proof that he had, in reality, no intention of marrying her and that the promise was only a subtle scheme or deceptive device to entice or inveigle her to accept him and to obtain her consent to the sexual act, could justify the award of damages pursuant to Article 21 not because of such promise to marry but because of the fraud and deceit behind it and the willful injury to her honor and reputation which followed thereafter. ",
                            "significance": "",
                            "correlation": "",
                            "details": "FRAUD AND DECEIT BEHIND BREACH OF PROMISE TO MARRY ENTITLES THE PLAINTIFF TO RECOVER DAMAGES",
                            "children": []
                        },
                        {
                            "url": "5. Pe vs. Pe",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "DAMAGES CAN BE RECOVERED BY THE FAMILY IF THE INJURY IS CAUSED IN A MANNER CONTRARY TO MORALS, GOOD CUSTOMS, AND PUBLIC POLICY",
                            "children": []
                        },
                        {
                            "name": "6. Globe Mackay Cable vs. CA",
                            "url": "",
                            "facts": "",
                            "issue": "Should petitioners be held liable for damages for the imputation of guilt and harassment during the investigations despite its claim of lawful exercise of its right to dismiss employee?",
                            "ruling": "Yes. Petitioners should be held liable for damages.",
                            "significance": "",
                            "correlation": "",
                            "details": "The imputation of guilt without basis and the pattern of harassment during the investigations of Tobias transgressed the standards of human conduct set forth in Article 19 of the Civil Code. The Court has already                         ruled that the right of the employer to dismiss an employee should not be confused with the manner in which the right is exercised and the effects flowing therefrom. If the dismissal is done abusively, then the employer is liable for damages to the employee. ",
                            "children": []
                        },
                        {
                            "name": "7. University of the East vs. Jader",
                            "url": "",
                            "facts": "",
                            "issue": "May a university be held liable for damages for misleading a student into believing that the latter had satisfied all the requirements for graduation?",
                            "ruling": "Yes. UE may be held liable. Considering that the institution of learning involved herein is a university which is engaged in legal education, it should have practiced what it inculcates in its students, more specifically the principle of good dealings enshrined in Articles 19 and 20 of the Civil Code. Educational institutions are duty-bound to inform the students of their academic status and not wait for the latter to inquire from the former.",
                            "significance": "",
                            "correlation": "",
                            "details": "When one of two innocent parties must suffer, he through whose agency the loss occurred must bear it. The modern tendency is to grant indemnity for damages in cases where there is abuse of right, even when the act is not illicit. If mere fault or negligence in one’s acts can make him liable for damages for injury caused thereby, with more reason should abuse or bad faith make him liable. A person should be protected only when he acts in the legitimate exercise of his right, that is, when he acts with prudence and in good faith, but not when he acts with negligence or abuse.",
                            "children": []
                        },
                        {
                            "name": "Meralco v. Ramos",
                            "url": "",
                            "facts": "",
                            "issue": "Does MERALCO have the right to immediately disconnect the electric service of the respondents upon discovery of an outside connection attached to their electric meter?",
                            "ruling": "No, Meralco has no right to do so.",
                            "significance": "",
                            "correlation": "",
                            "details": "BAD FAITH IS PRESUMED IF THERE IS FAILURE TO COMPLY WITH THE STRICT REQUIREMENTS OF THE LAW THAT PREJUDICES/INJURES ANOTHER",
                            "children": []
                        },                        
                        {
                            "name": "8. Tenchavez vs. Escano",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "9. St Louis Realty vs. CA",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "10. Gregorio v. Court of Appeals",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "11. Capili v. People",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "12. Tenebro v. Court of Appeals",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "13. Montañez v. Cipriano",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "14. San Miguel Proeprties, Inc., v. Perez",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "15. Navarro-Banaria v. Banaria",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "16. Mercado v. Ongpin",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "17. In the matter of the petition to approve the will of Luz Gaspe Lipson and issuance of letters testamentary",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "18. Spouses Cabasal vs. BPI Family Savings Bank and Alma De Leon",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "Marcia v. Cajo",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "in relation to Art. 33 and reckless imprudence",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "III. Persons (Art. 37-51, New Civil Code) ",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "1. Quimiguing vs. Icao",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "2. Geluz v. CA",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "3. Limjoco vs. Estate of Pedro Fragante",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "4. Moy Ya Lim Yao vs. CID",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "5. Republic v. Batuigas",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "6. Frivaldo vs. COMELEC",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "7. Romualdez-Marcos vs. COMELEC",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "Module 2",
            "url": "",
            "facts": "",
            "issue": "",
            "ruling": "",
            "significance": "",
            "correlation": "",
            "details": "",
            "children": [
                {
                    "name": "I.Requisites of Marriage",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "Cases",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "Void Marriages",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "AM No. 02-11-10-SC, March 4, 2003",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "AM No. 02-11-12-SC, MArch 4, 2003",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "Cases",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": [
                                {
                                    "name": "Arts. 35-36",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "",
                                    "children": []
                                },
                                {
                                    "name": "Arts. 37-44",
                                    "url": "",
                                    "facts": "",
                                    "issue": "",
                                    "ruling": "",
                                    "significance": "",
                                    "correlation": "",
                                    "details": "",
                                    "children": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Module 3",
            "url": "",
            "facts": "",
            "issue": "",
            "ruling": "",
            "significance": "",
            "correlation": "",
            "details": "",
            "children": [
                {
                    "name": "I. Voidable Marriages (Arts. 45-54, FC)",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "AM No. 02-11-10-SC, March 4, 2003",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "AM No. 02-11-12-SC, MArch 4, 2003",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "Cases",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "II. Legal Separation (Arts. 55-67, FC)",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": [
                        {
                            "name": "AM No. 02-11-10-SC, March 4, 2003",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "AM No. 02-11-12-SC, MArch 4, 2003",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        },
                        {
                            "name": "Cases",
                            "url": "",
                            "facts": "",
                            "issue": "",
                            "ruling": "",
                            "significance": "",
                            "correlation": "",
                            "details": "",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "III. Rights and Obligations between Husband and Wife",
                    "url": "",
                    "facts": "",
                    "issue": "",
                    "ruling": "",
                    "significance": "",
                    "correlation": "",
                    "details": "",
                    "children": []
                }
            ]
        }
    ]
}